УНФ_ТЕСТ/src/Catalogs/КП_ВидыПроцессов/КП_ВидыПроцессов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КП_ВидыПроцессов</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ДействиеПараллельное</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДействиеРеквизитыРасполагатьВДваСтолбца</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИзменениеТекстаПроцессаПослеСтартаРазрешено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникОсновныхИсполнителей</name>
    <comment>0 - список исполнителей, 1 - рабочая группа</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контролер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>КопироватьОставлятьИсполнителейЗаданныхВНастройкеВида</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КопироватьПолучателейИзДокумента</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КопироватьСотрудниковИзДокумента</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеГруппы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РабочаяГруппаОсновныхИсполнителей</name>
    <type>
      <types>CatalogRef.КП_РабочиеГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>СистемныйВидПроцесса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеКартыПроцесса</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеОписанияПроцесса</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеТекстаПроцесса</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблоныДокументовДляНовыхФайлов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИзменениеСхемыПроцессаПослеСтартаРазрешено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматШаблонаНаименований</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИзменениеКонтролераПроцессаПослеСтартаРазрешено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаДоступа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СетьМаршрутныхТочек</name>
    <attributes>
      <name>ТочкаВыход</name>
      <type>
        <types>CatalogRef.КП_ТочкиПроцессов</types>
      </type>
    </attributes>
    <attributes>
      <name>ТочкаВход</name>
      <type>
        <types>CatalogRef.КП_ТочкиПроцессов</types>
      </type>
    </attributes>
    <attributes>
      <name>УсловныйПереход</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>УсловиеПерехода</name>
      <comment>для точки Условия - 0 (нет), 1 (да); для точки ВыборВарианта - номер варианта</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяЛинииНаСхеме</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УсловиеПереходаНаименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОсновныеИсполнители</name>
    <attributes>
      <name>ТочкаАдресации</name>
      <type>
        <types>CatalogRef.КП_РолеваяАдресация</types>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтчетИсполнителя</name>
      <type>
        <types>CatalogRef.КП_ТребуемыеРезультатыИсполнителей</types>
      </type>
    </attributes>
    <attributes>
      <name>СрокВыполненияТекст</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИндивидуальныйТекстЗадания</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИндивидуальноеНаименованиеЗадания</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СрокВыполненияЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>8</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидНаправленияПараллельное</name>
      <comment>1 - параллельное, 0 - последовательное</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НеИспользоватьГрафикРаботы</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИднИсполнителя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СрокВыполненияДатаВремя</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НаименованияЭлементовПроцесса</name>
    <attributes>
      <name>ЭлементФормы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеЭлемента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеЭлементаИностранное</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Видимость</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НаименованияЭлементовЗадач</name>
    <attributes>
      <name>ЭлементФормы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеЭлемента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеЭлементаИностранное</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Видимость</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РеквизитыПроцессов</name>
    <comment>Реквизиты процессов</comment>
    <attributes>
      <name>РеквизитПроцесса</name>
      <type>
        <types>CatalogRef.КП_ДополнительныеРеквизиты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПроектыБизнесПроцесса</name>
    <attributes>
      <name>Проект</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УНФ_ТЕСТ/src/Catalogs/КП_ВидыПроцессов/Forms/ФормаНастройкаФорматаНаименования/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ФорматШаблонаНаименований", ФорматШаблонаНаименований);
	Параметры.Свойство("ВидПроцесса", ВидПроцессаСсылка);
	
	ПрочитатьНастройкиСервером();
	
	УстановитьОформлениеЭлементов();
	
	ЗаполнитьТаблицуЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	ЗакрытьФорму();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму()
	РезультатФормы=СокрЛП(ФорматШаблонаНаименований);
	Модифицированность=Ложь;
	Закрыть(РезультатФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВФормат(Команда)
	ПоказатьВопрос(Новый ОписаниеОповещения("ДобавитьВФорматЗавершение", ЭтотОбъект), НСтр("en='Do you want to add items to the template?';ru='Добавить элементы в шаблон наименования?'"), РежимДиалогаВопрос.ДаНет,,,КП_ОбщееКлиент.ЗаголовокДиалога());	
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВФорматЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
    Если РезультатВопроса=КодВозвратаДиалога.Нет Тогда
        Возврат;
        
    КонецЕсли;
    
    СтрокаЭлементов="";
    
    ЭлементДобавлен=Ложь;
    
    Для Каждого СтрокаТЧ Из ТаблицаЭлементов Цикл
        Если НЕ СтрокаТЧ.ДобавитьВФормат Тогда
            Продолжить;
        КонецЕсли;
        
        СтрокаЭлемента="{"+СокрЛП(СтрокаТЧ.ЭлементНаименования)+"}";
        
        Если Найти(ФорматШаблонаНаименований, СтрокаЭлемента)>0 Тогда
            //элемент уже есть в списке
            Продолжить;
        КонецЕсли;
        
        ФорматШаблонаНаименований=ФорматШаблонаНаименований+" "+СтрокаЭлемента;	
        ЭлементДобавлен=Истина;
        
    КонецЦикла;
    
    Модифицированность=ЭлементДобавлен;

КонецПроцедуры

//&НаКлиенте
//Процедура ДекорацияПоказатьДоступныеЭлементыНажатие(Элемент)
//	ФлагТаблицаЭлементовПоказана=НЕ ФлагТаблицаЭлементовПоказана;
//	
//	УстановитьОформлениеЭлементов();
//	
//КонецПроцедуры

Процедура УстановитьОформлениеЭлементов()
	//Если ФлагТаблицаЭлементовПоказана Тогда
	//	Элементы.ДекорацияПоказатьДоступныеЭлементы.Заголовок=НСтр("ru='↑ Скрыть доступные элементы'; en='↑ Hide template elements';");
	//	
	//Иначе
	//	Элементы.ДекорацияПоказатьДоступныеЭлементы.Заголовок=НСтр("ru='↓ Показать доступные элементы'; en='↓ Show template elements';");
	//	
	//КонецЕсли;
	//
	//Элементы.ГруппаДоступныеЭлементы.Видимость=ФлагТаблицаЭлементовПоказана;
		
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНастройкиСервером()
	
	КП_ОбщееСервер.СохранитьНастройкуПользователя("ВидБизнесПроцессаШаблонФормированияНаименования", "ПоказыватьДоступныеЭлементы", ФлагТаблицаЭлементовПоказана);
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьНастройкиСервером()
	
	ФлагТаблицаЭлементовПоказана=КП_ОбщееСервер.ЗагрузитьНастройкуПользователя("ВидБизнесПроцессаШаблонФормированияНаименования", "ПоказыватьДоступныеЭлементы");	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	ЗаписатьНастройкиСервером();
	
КонецПроцедуры

&НаКлиенте
Процедура ФорматШаблонаНаименованийПриИзменении(Элемент)
	Модифицированность=Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	ПоказатьВопрос(Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтотОбъект), НСтр("en='Do you want to save changes?';ru='Сохранить изменения?'"), РежимДиалогаВопрос.ДаНет,,,КП_ОбщееКлиент.ЗаголовокДиалога());
		
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
    Если Модифицированность И РезультатВопроса=КодВозвратаДиалога.Да Тогда
        ЗакрытьФорму();
        
    КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуЭлементов()
	//добавим наименование
	НоваяСтрока=ТаблицаЭлементов.Добавить();
	НоваяСтрока.ЭлементНаименования="НаименованиеВида";
	НоваяСтрока.ДобавитьВФормат=ПустаяСтрока(ФорматШаблонаНаименований);
	
	//добавим реквизиты
	Для Каждого СтрокаТЧ Из ВидПроцессаСсылка.РеквизитыПроцессов Цикл
		ИмяРеквизитаДляФункций=СокрЛП(СтрокаТЧ.РеквизитПроцесса.ИмяРеквизитаДляФункций);
		НоваяСтрока=ТаблицаЭлементов.Добавить();
		НоваяСтрока.ЭлементНаименования="Реквизит."+ИмяРеквизитаДляФункций;
		НоваяСтрока.Примечание="Наименование реквизита из списка реквизитов процесса";
		НоваяСтрока.ДобавитьВФормат=Ложь;
		
	КонецЦикла;
	
	//добавим пользователей
	НоваяСтрока=ТаблицаЭлементов.Добавить();
	НоваяСтрока.ЭлементНаименования="ОсновныеИсполнители[0]";
	НоваяСтрока.ДобавитьВФормат=Ложь;
	НоваяСтрока.Примечание="Используете [НомерСтроки] для указания нужной строки исполнителя";
	
	//добавим документы
	НоваяСтрока=ТаблицаЭлементов.Добавить();
	НоваяСтрока.ЭлементНаименования="СписокДокументов[0]";
	НоваяСтрока.ДобавитьВФормат=Ложь;
	НоваяСтрока.Примечание="Используете [НомерСтроки] для указания нужной строки документа";
	
КонецПроцедуры
